      ******************************************************************
      * Author:SUBASH S L
      * Date: 25-Aug-2023
      * Purpose: Program that displays the message "Hello Word!" on screen
      * A typical first program while learning any new programming language
      *
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "Hello World!".
           STOP RUN.
